# OnOpenConflict Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IOpenFromCloudCallback..::..OnOpenConflict Method
IOpenFromCloudCallback Interface See Also
---
A method called when the conflict is happen during the model opening.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
OpenConflictResult OnOpenConflict(
	OpenConflictScenario scenario
)
```

Visual Basic
---
```text
Function OnOpenConflict ( _
	scenario As OpenConflictScenario _
) As OpenConflictResult
```

Visual C++
---
```text
OpenConflictResult OnOpenConflict(
	OpenConflictScenario scenario
)
```

# ### Parameters
scenario
    Type: Autodesk.Revit.DB..::..OpenConflictScenario The scenario of the conflict.
# ### Return Value
Returns the result to indicate whether to keep the unsynchronized change, or open the latest version or cancel the open action.
# See Also
IOpenFromCloudCallback Interface
Autodesk.Revit.DB Namespace